//сервер это программа,которая позволяет запускать веб-сайты ы вольнять болле сложнои монипуляции

//на сервисе стоят интерпритаторы и эту часть пользователь не видит
//хостинг-покупка определеннного места на компьютере у хостинг провайдера

//папка будет подписана нашим доменным именем

//хостинг провайдер должен постоянно иметь включенный сервер

//серверы:
//простые(локальные) live server, brouser think(можем в пределах нашей wi-fi сети получать доступ к сайту)
//http, json сервера

//http-запросы:
//get-запрос -запрос на поолучение данных
//post-запрос отправление данных на сервер

//live server, открытие в браузере не поддерживает get-запрос 

//ajex-серверная технология, позволяет отправлять get и post запросы без перезагрузки страницы 



